Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/edc/PIC32MK0512MCM100.PIC
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="r-------------------------------" edc:cname="Config2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="Config2" edc:nmmrflags="0b" edc:nmmrid="448" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="r-------rrrrrrrnrrrrrr-r-rrrr--r" edc:cname="Config3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000101000101011110101101000" edc:name="Config3" edc:nmmrflags="0c" edc:nmmrid="576" edc:nzwidth="0x20" edc:por="10000000101000101011110101101000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TL" edc:desc="" edc:mask="0x1" edc:name="TL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CDMM" edc:desc="" edc:mask="0x1" edc:name="CDMM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SP" edc:desc="" edc:mask="0x1" edc:name="SP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VInt" edc:desc="" edc:mask="0x1" edc:name="VInt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VEIC" edc:desc="" edc:mask="0x1" edc:name="VEIC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ITL" edc:desc="" edc:mask="0x1" edc:name="ITL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DSPP" edc:desc="" edc:mask="0x1" edc:name="DSPP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSP2P" edc:desc="" edc:mask="0x1" edc:name="DSP2P" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXI" edc:desc="" edc:mask="0x1" edc:name="RXI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ULRI" edc:desc="" edc:mask="0x1" edc:name="ULRI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ISA" edc:desc="" edc:mask="0x3" edc:name="ISA" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ISAONEXC" edc:desc="" edc:mask="0x1" edc:name="ISAONEXC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCU" edc:desc="" edc:mask="0x1" edc:name="MCU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MMAR" edc:desc="" edc:mask="0x7" edc:name="MMAR" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="IPLW" edc:desc="" edc:mask="0x3" edc:name="IPLW" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="VZ" edc:desc="" edc:mask="0x1" edc:name="VZ" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="r-------------------------------" edc:cname="Config4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="Config4" edc:nmmrflags="0d" edc:nmmrid="704" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="r----------------------------n-r" edc:cname="Config5" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000001" edc:name="Config5" edc:nmmrflags="0e" edc:nmmrid="832" edc:nzwidth="0x20" edc:por="00000000000000000000000000000001">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NF" edc:desc="" edc:mask="0x1" edc:name="NF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="UFR" edc:desc="" edc:mask="0x1" edc:name="UFR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="28"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="r------------r------------------" edc:cname="Config7" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="Config7" edc:nmmrflags="0" edc:nmmrid="1088" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="18"/>
            <edc:SFRFieldDef edc:cname="HCI" edc:desc="" edc:mask="0x1" edc:name="HCI" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="12"/>
            <edc:SFRFieldDef edc:cname="WII" edc:desc="" edc:mask="0x1" edc:name="WII" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="----rrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="LLAddr" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="LLAddr" edc:nmmrflags="0t" edc:nmmrid="196" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PAddr" edc:desc="" edc:mask="0xfffffff" edc:name="DSS" edc:nzwidth="0x1C"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WatchLo" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchLo" edc:nmmrflags="0t" edc:nmmrid="200" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VAddr" edc:desc="" edc:mask="0x1fffffff" edc:name="VAddr" edc:nzwidth="0x1d"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WatchLo1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchLo1" edc:nmmrflags="0a" edc:nmmrid="328" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VAddr" edc:desc="" edc:mask="0x1fffffff" edc:name="VAddr" edc:nzwidth="0x1d"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WatchLo2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchLo2" edc:nmmrflags="0b" edc:nmmrid="456" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VAddr" edc:desc="" edc:mask="0x1fffffff" edc:name="VAddr" edc:nzwidth="0x1d"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
