Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/edc/PIC32MK0512MCM100.PIC
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="KScratch1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="KScratch1" edc:nmmrflags="St" edc:nmmrid="508" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="KScratch1" edc:desc="" edc:mask="0xffffffff" edc:name="KScratch1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="KScratch2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="KScratch2" edc:nmmrflags="St" edc:nmmrid="636" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="KScratch2" edc:desc="" edc:mask="0xffffffff" edc:name="KScratch2" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:NMMRPlace>
    <edc:EmulatorSector edc:beginaddr="0xff300000" edc:endaddr="0xff400000" edc:regionid="emulation"/>
    <edc:DeviceIDSector edc:_mask="0x0fffffff" edc:beginaddr="0xffffffff" edc:endaddr="0xffffffff" edc:mask="0x0FFFFFFF" edc:regionid="devid" edc:useinchecksum="0x0fffffff" edc:value="0x08B04053">
      <edc:DEVIDToRev edc:revlist="B0" edc:value="0x10000000"/>
      <edc:DEVIDToRev edc:revlist="B1" edc:value="0x20000000"/>
      <edc:DEVIDToRev edc:revlist="B2" edc:value="0x30000000"/>
    </edc:DeviceIDSector>
    <edc:CodeSector edc:beginaddr="0x1d000000" edc:endaddr="0x1d080000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:kuseg="0x60000000" edc:regionid="code"/>
    <edc:TestZone edc:beginaddr="0x1fc65000" edc:endaddr="0x1fc66000" edc:regionid="testmem"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc40000" edc:endaddr="0x1fc43f30" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="boot1"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc44000" edc:endaddr="0x1fc45000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="boot1lastpage"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc60000" edc:endaddr="0x1fc63f30" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="boot2"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc64000" edc:endaddr="0x1fc65000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="boot2lastpage"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc20000" edc:endaddr="0x1fc23f30" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="upperbootalias"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc24000" edc:endaddr="0x1fc25000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="upperbootaliaslastpage"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc00000" edc:endaddr="0x1fc03f30" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="lowerbootalias"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc04000" edc:endaddr="0x1fc05000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="lowerbootaliaslastpage"/>
    <edc:ConfigFuseSector edc:beginaddr="0x1fc03fb0" edc:endaddr="0x1fc04000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="lowerbootaliasconfig">
      <edc:AdjustPoint edc:_addr="0x1FC03FB0" edc:offset="0x10"/>
      <edc:DCRDef edc:_addr="0x1FC03FC0" edc:access="nnnnn---nn-n----nnnnnnnnnnnnnnnn" edc:cname="DEVCFG3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xf8d0ffff" edc:name="DEVCFG3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffff0000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="USERID" edc:desc="" edc:mask="0xffff" edc:name="USERID" edc:nzwidth="16"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:DCRFieldDef edc:cname="PWMLOCK" edc:desc="PWM IOxCON lock" edc:mask="0x1" edc:name="PWMLOCK" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PWM IOxCON register write accessess must use the PWMKEY unlock proceedure" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PWM IOxCON register writes accesses are not locked or protected" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="FUSBIDIO2" edc:desc="USB2 USBID Selection" edc:mask="0x1" edc:name="FUSBIDIO2" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="USBID pin is controlled by the USB2 module" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="USBID pin is controlled by the port function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FVBUSIO2" edc:desc="USB2 VBUSON Selection bit" edc:mask="0x1" edc:name="FVBUSIO2" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="VBUSON pin is controlled by the USB2 module" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="VBUSON pin is controlled by the port function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="PGL1WAY" edc:desc="Permission Group Lock One Way Configuration bit" edc:mask="0x1" edc:name="PGL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PMDL1WAY" edc:desc="Peripheral Module Disable Configuration" edc:mask="0x1" edc:name="PMDL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IOL1WAY" edc:desc="Peripheral Pin Select Configuration" edc:mask="0x1" edc:name="IOL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FUSBIDIO1" edc:desc="USB1 USBID Selection" edc:mask="0x1" edc:name="FUSBIDIO1" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="USBID pin is controlled by the USB1 module" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="USBID pin is controlled by the port function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FVBUSIO1" edc:desc="USB2 VBUSON Selection bit" edc:mask="0x1" edc:name="FVBUSIO1" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="VBUSON pin is controlled by the USB1 module" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="VBUSON pin is controlled by the port function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
