Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/edc/PIC32MK0512MCM100.PIC
      <edc:SFRDef edc:_addr="0x1F801520" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="69" edc:access="----------------------------nnnn" edc:cname="SCK6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SCK6R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SCK6R" edc:desc="" edc:mask="0xf" edc:name="SCK6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801524" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="70" edc:access="----------------------------nnnn" edc:cname="SDI6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SDI6R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDI6R" edc:desc="" edc:mask="0xf" edc:name="SDI6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801528" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="71" edc:access="----------------------------nnnn" edc:cname="SS6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SS6R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SS6R" edc:desc="" edc:mask="0xf" edc:name="SS6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80152C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="72" edc:access="----------------------------nnnn" edc:cname="C3RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="C3RXR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C3RXR" edc:desc="" edc:mask="0xf" edc:name="C3RXR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801530" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="73" edc:access="----------------------------nnnn" edc:cname="C4RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="C4RXR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C4RXR" edc:desc="" edc:mask="0xf" edc:name="C4RXR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801534" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="74" edc:access="----------------------------nnnn" edc:cname="QEA3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="QEA3R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEA3R" edc:desc="" edc:mask="0xf" edc:name="QEA3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801538" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="75" edc:access="----------------------------nnnn" edc:cname="QEB3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="QEB3R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEB3R" edc:desc="" edc:mask="0xf" edc:name="QEB3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80153C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="76" edc:access="----------------------------nnnn" edc:cname="INDX3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="INDX3R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INDX3R" edc:desc="" edc:mask="0xf" edc:name="INDX3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801540" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="77" edc:access="----------------------------nnnn" edc:cname="HOME3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="HOME3R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HOME3R" edc:desc="" edc:mask="0xf" edc:name="HOME3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801544" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="78" edc:access="----------------------------nnnn" edc:cname="QEA4R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="QEA4R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEA4R" edc:desc="" edc:mask="0xf" edc:name="QEA4R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801548" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="79" edc:access="----------------------------nnnn" edc:cname="QEB4R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="QEB4R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEB4R" edc:desc="" edc:mask="0xf" edc:name="QEB4R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80154C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="80" edc:access="----------------------------nnnn" edc:cname="INDX4R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="INDX4R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INDX4R" edc:desc="" edc:mask="0xf" edc:name="INDX4R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801550" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="81" edc:access="----------------------------nnnn" edc:cname="HOME4R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="HOME4R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HOME4R" edc:desc="" edc:mask="0xf" edc:name="HOME4R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801554" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="82" edc:access="----------------------------nnnn" edc:cname="QEA5R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="QEA5R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEA5R" edc:desc="" edc:mask="0xf" edc:name="QEA5R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801558" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="83" edc:access="----------------------------nnnn" edc:cname="QEB5R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="QEB5R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEB5R" edc:desc="" edc:mask="0xf" edc:name="QEB5R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80155C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="84" edc:access="----------------------------nnnn" edc:cname="INDX5R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="INDX5R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INDX5R" edc:desc="" edc:mask="0xf" edc:name="INDX5R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801560" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="85" edc:access="----------------------------nnnn" edc:cname="HOME5R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="HOME5R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HOME5R" edc:desc="" edc:mask="0xf" edc:name="HOME5R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801564" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="86" edc:access="----------------------------nnnn" edc:cname="QEA6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="QEA6R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEA6R" edc:desc="" edc:mask="0xf" edc:name="QEA6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801568" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="87" edc:access="----------------------------nnnn" edc:cname="QEB6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="QEB6R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEB6R" edc:desc="" edc:mask="0xf" edc:name="QEB6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80156C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="88" edc:access="----------------------------nnnn" edc:cname="INDX6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="INDX6R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INDX6R" edc:desc="" edc:mask="0xf" edc:name="INDX6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801570" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="89" edc:access="----------------------------nnnn" edc:cname="HOME6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="HOME6R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HOME6R" edc:desc="" edc:mask="0xf" edc:name="HOME6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801574" edc:offset="0x8C"/>
      <edc:SFRDef edc:_addr="0x1F801600" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="1" edc:access="---------------------------nnnnn" edc:cname="RPA0R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPA0R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA0R" edc:desc="" edc:mask="0x1f" edc:name="RPA0R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801604" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="2" edc:access="---------------------------nnnnn" edc:cname="RPA1R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPA1R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA1R" edc:desc="" edc:mask="0x1f" edc:name="RPA1R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
