Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/edc/PIC32MK0512MCM100.PIC
      <edc:SFRDef edc:_addr="0x1F82AB00" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="12" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PHASE11" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="PHASE11" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PHASE" edc:mask="0xffff" edc:name="PHASE" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82AB10" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="12" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DTR11" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="DTR11" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DTR" edc:mask="0xffff" edc:name="DTR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82AB20" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="12" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ALTDTR11" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="ALTDTR11" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ALTDTR" edc:mask="0xffff" edc:name="ALTDTR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82AB30" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="12" edc:access="------------------nnnnnnnnnnnnnn" edc:cname="DTCOMP11" edc:desc="" edc:impl="0x3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00000000000000" edc:name="DTCOMP11" edc:nzwidth="32" edc:por="------------------00000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="COMP" edc:mask="0x3fff" edc:name="COMP" edc:nzwidth="0xe"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82AB40" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="12" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TRIG11" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="TRIG11" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRGCMP" edc:mask="0xffff" edc:name="TRGCMP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82AB50" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="12" edc:access="----------------nnnnnnnnnn------" edc:cname="TRGCON11" edc:desc="" edc:impl="0xffc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000------" edc:name="TRGCON11" edc:nzwidth="32" edc:por="----------------0000000000------" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="STRGIS" edc:mask="0x1" edc:name="STRGIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTM" edc:mask="0x1" edc:name="DTM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGSEL" edc:mask="0x3" edc:name="STRGSEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TRGSEL" edc:mask="0x3" edc:name="TRGSEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TRGDIV" edc:mask="0xf" edc:name="TRGDIV" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82AB60" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="12" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="STRIG11" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="STRIG11" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STRGCMP" edc:mask="0xffff" edc:name="STRGCMP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82AB70" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="12" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CAP11" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CAP11" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CAP" edc:mask="0xffff" edc:name="CAP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82AB80" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="12" edc:access="----------------nnnnnn----------" edc:cname="LEBCON11" edc:desc="" edc:impl="0xfc00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000000----------" edc:name="LEBCON11" edc:nzwidth="32" edc:por="----------------000000----------" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xa"/>
            <edc:SFRFieldDef edc:cname="CLLEBEN" edc:mask="0x1" edc:name="CLLEBEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTLEBEN" edc:mask="0x1" edc:name="FLTLEBEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PLF" edc:mask="0x1" edc:name="PLF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PLR" edc:mask="0x1" edc:name="PLR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PHF" edc:mask="0x1" edc:name="PHF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PHR" edc:mask="0x1" edc:name="PHR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82AB90" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="12" edc:access="--------------------nnnnnnnnnnnn" edc:cname="LEBDLY11" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000000000000" edc:name="LEBDLY11" edc:nzwidth="32" edc:por="--------------------000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LEB" edc:mask="0xfff" edc:name="LEB" edc:nzwidth="0xc"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82ABA0" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="12" edc:access="--------------------------nnnnnn" edc:cname="AUXCON11" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------000000" edc:name="AUXCON11" edc:nzwidth="32" edc:por="--------------------------000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHOPLEN" edc:mask="0x1" edc:name="CHOPLEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHOPHEN" edc:mask="0x1" edc:name="CHOPHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHOPSEL" edc:mask="0xf" edc:name="CHOPSEL" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
